#pragma once

#include <VirtualizerSDK.h>
#include <VirtualizerSDK_CustomVMs.h>

#include <ntifs.h>
#include <ntddstor.h>
#include <mountdev.h>
#include <ntddvol.h>
#include <ntstrsafe.h>
#include <ntimage.h>
#include <wdm.h>
#include <intrin.h>
#include <ntddk.h>

#include "xorstr.h"

#include "address.h"

#ifndef _MSC_VER
extern "C" void __movsb( unsigned char*, unsigned char const*, size_t );
extern "C" void __stosb( unsigned char*, unsigned char, size_t );
#endif

#include "xorstr.h"

#ifdef _DEBUG
#define drv_log( s, ... ) DbgPrintEx( DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, s, __VA_ARGS__ )
#else
#define drv_log( s, ... ) DbgPrintEx( DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, s, __VA_ARGS__ )
#endif

extern "C" void system_crash( );
extern "C" void _sti( ); // _enable
extern "C" void _cli( ); // _disable

#define game_name ( "csgo.exe" )

namespace utils
{
	 struct module_t
	 {
		  uint64_t m_base;
		  uint32_t m_size;

		  bool initialize( const char* mod_name );
	 };

	 struct patch_t
	 {
		  uint64_t m_rva;
		  uint8_t m_patches[ 0x10 ];
		  size_t m_patch_size;

		  bool operator==( patch_t& o )
		  {
				return this->m_rva == o.m_rva;
		  }
	 };

	 template< typename _ty, uint32_t tag >
	 class c_vector
	 {
	 private:
		  uint32_t m_size;
		  _ty* m_data;

	 public:
		  void shutdown( )
		  {
				ExFreePoolWithTag( m_data, tag );
		  }

		  void erase( uint32_t pos )
		  {
				--m_size;

				if ( !m_size )
				{
					 if ( m_data )
						  ExFreePoolWithTag( m_data, tag );

					 m_data = nullptr;
					 return;
				}

				void* temp = ExAllocatePoolWithTag( PagedPool, sizeof( _ty ) * m_size, tag );

				if ( pos )
					 __movsb( reinterpret_cast< PUCHAR >( temp ), reinterpret_cast< PUCHAR >( m_data ), sizeof( _ty ) * pos );
				else if ( !m_size )
				{
					 ExFreePoolWithTag( temp, tag );
					 ExFreePoolWithTag( m_data, tag );
				}

				__movsb( reinterpret_cast< PUCHAR >( ( uint64_t )temp + ( pos * 8 ) ), reinterpret_cast< PUCHAR >( ( uint64_t )m_data + ( ( pos + 1 ) * 8 ) ), sizeof( _ty ) * ( m_size - pos ) );
				ExFreePoolWithTag( m_data, tag );
				m_data = reinterpret_cast< _ty* >( temp );
		  }

		  void push( _ty value, bool ignore_same = false )
		  {
				if ( !m_size )
				{
					 m_data = reinterpret_cast< _ty* >( ExAllocatePoolWithTag( PagedPool, sizeof( _ty ), tag ) );
					 m_data[ m_size++ ] = value;

					 return;
				}
				else if ( ignore_same )
				{
					 for ( uint32_t i = 0; i < m_size; ++i )
						  if ( m_data[ i ] == value )
								return;
				}

				++m_size;
				void* temp = ExAllocatePoolWithTag( PagedPool, sizeof( _ty ) * m_size, tag );
				__movsb( reinterpret_cast< PUCHAR >( temp ), reinterpret_cast< PUCHAR >( m_data ), sizeof( _ty ) * ( m_size - 1 ) );
				ExFreePoolWithTag( m_data, tag );
				m_data = reinterpret_cast< _ty* >( temp );
				m_data[ m_size - 1 ] = value;
		  }

		  _ty pop( )
		  {
				--m_size;

				if ( !m_size )
				{
					 _ty val = m_data[ 0 ];
					 ExFreePoolWithTag( m_data, tag );
					 m_data = 0;
					 return val;
				}

				void* temp = ExAllocatePoolWithTag( PagedPool, sizeof( _ty ) * m_size, tag );
				__movsb( reinterpret_cast< PUCHAR >( temp ), reinterpret_cast< PUCHAR >( m_data ), sizeof( _ty ) * m_size );
				_ty val = m_data[ m_size ];
				ExFreePoolWithTag( m_data, tag );
				m_data = reinterpret_cast< _ty* >( temp );
				return val;
		  }

		  _ty* data( )
		  {
				return m_data;
		  }

		  uint32_t size( ) const
		  {
				return m_size;
		  }

		  _ty& operator[ ]( uint32_t index )
		  {
				return m_data[ index ];
		  }

		  bool find( _ty val )
		  {
				for ( uint32_t i = 0; i < m_size; ++i )
					 if ( m_data[ i ] == val )
						  return true;
				return false;
		  }
	 };

	 UNICODE_STRING init_unicode_string( wchar_t* str );
	 uint64_t find_pattern_stub( module_t mod, const char* pattern );
	 uint32_t strtoul( const char* nptr, char** endptr, int base );
	 NTSTATUS write_to_readonly_memory( void* dst, void* src, uint64_t size );

	 template< typename _ty >
	 _ty* strstr( _ty* str1, _ty* str2 )
	 {
		  if ( !*str2 )
				return str1;

		  for ( size_t i = 0; i < strlen( str1 ); i++ )
		  {
				if ( *( str1 + i ) == *str2 )
				{
					 _ty* ptr = strstr( str1 + i + 1, str2 + 1 );
					 return ( ptr ) ? ptr - 1 : nullptr;
				}
		  }

		  return nullptr;
	 }

	 template< typename _ty >
	 size_t strlen( const _ty* str )
	 {
		  size_t length = 0;
		  while ( str[ length ] )
				++length;
		  return length;
	 }

	 template< typename _ty = uint64_t >
	 address_t< _ty > find_pattern( module_t module, const char* pattern )
	 {
		  return address_t< _ty >( ( _ty* )( find_pattern_stub( module, pattern ) ) );
	 }

#ifdef _MSC_VER
	 __forceinline
#else
	 __attribute__( ( always_inline ) )
#endif
		  void memset( void* address, uint8_t val, size_t size )
	 {
		  __stosb( reinterpret_cast< uint8_t* >( address ), val, size );
	 }

#ifdef _MSC_VER
	 __forceinline
#else
	 __attribute__( ( always_inline ) )
#endif
		  void memcpy( void* dst, const void* src, size_t size )
	 {
		  __movsb( reinterpret_cast< uint8_t* >( dst ), reinterpret_cast< const uint8_t* >( src ), size );
	 }

	 void sleep( uint64_t ms );

	 extern module_t m_krnl;
	 inline c_vector< uint32_t, 'ldpi' > m_loader_process_id{ };
	 inline c_vector< uint32_t, 'gmpi' > m_game_process_id{ };
	 inline c_vector< uint32_t, 'appi' > m_allowed_process_id{ };
	 inline HANDLE m_fake_ntoskrnl;
	 inline c_vector< patch_t, 'kpvr' > m_kernel_patches{ };
	 extern uint32_t m_krnl_process_id;
	 extern char m_key[ 32 ];
}

#include "hash.h"

#pragma warning( push )
#pragma warning( disable : 4201 )

typedef enum _SYSTEM_INFORMATION_CLASS
{
	 SystemBasicInformation = 0,
	 SystemPerformanceInformation = 2,
	 SystemTimeOfDayInformation = 3,
	 SystemProcessInformation = 5,
	 SystemProcessorPerformanceInformation = 8,
	 SystemModuleInformation = 11,
	 SystemInterruptInformation = 23,
	 SystemExceptionInformation = 33,
	 SystemRegistryQuotaInformation = 37,
	 SystemLookasideInformation = 45,
	 SystemCodeIntegrityInformation = 103,
	 SystemPolicyInformation = 134,
} SYSTEM_INFORMATION_CLASS;

struct list_entry32_t
{
	 uint32_t m_flink;
	 uint32_t m_blink;
};

struct list_entry64_t
{
	 uint64_t m_flink;
	 uint64_t m_blink;
};

struct unicode_string32_t
{
	 uint16_t m_length;
	 uint16_t m_max_length;
	 uint32_t m_buffer;
};

// x64
struct unicode_string_t
{
	 uint16_t m_length;
	 uint16_t m_max_length;
	 wchar_t* m_buffer;
};

struct sys_module_entry_t
{
	 HANDLE		m_section;
	 uintptr_t	m_mapped_base;
	 uintptr_t	m_image_base;
	 uint32_t		m_image_size;
	 uint32_t		m_flags;
	 uint16_t		m_load_order_index;
	 uint16_t		m_init_order_index;
	 uint16_t		m_load_count;
	 uint16_t		m_offset_to_file_name;
	 uint8_t		m_full_path_name[ 256u ];
};

struct sys_module_info_t
{
	 uint32_t					m_count;
	 sys_module_entry_t	m_module[ 1u ];
};

struct sys_process_info_t
{
	 uint32_t				m_next_entry_offset;
	 uint32_t				m_threads_count;
	 uint8_t				pad0[ 48u ];
	 unicode_string_t	m_image_name;
	 KPRIORITY			m_base_priority;
	 HANDLE				m_unique_process_id;
	 uintptr_t			pad1;
	 uint32_t				m_handle_count;
	 uint32_t				m_session_id;
	 uintptr_t			pad2;
	 size_t				m_peak_virtual_size;
	 size_t				m_virtual_size;
	 uint32_t				pad3;
	 size_t				m_peak_working_set_size;
	 size_t				m_working_set_size;
	 uintptr_t			pad4;
	 size_t				m_quota_paged_pool_usage;
	 uintptr_t			pad5;
	 size_t				m_quota_non_paged_pool_usage;
	 size_t				m_pagefile_usage;
	 size_t				m_peak_pagefile_usage;
	 size_t				m_private_page_count;
	 LARGE_INTEGER		pad6[ 6u ];
};

struct rtl_avl_tree_t
{
	 PRTL_BALANCED_NODE	m_root;
	 void* m_node_hint;
	 uint64_t					m_number_generic_table_elements;
};

struct cur_dir32_t
{
	 unicode_string32_t	m_dos_path;
	 uint32_t					m_handle;
};

// 64
struct cur_dir_t
{
	 unicode_string_t	m_dos_path;
	 uint32_t				m_handle;
};

struct rtl_user_process_params32_t
{
	 uint64_t					pad0;
	 uint32_t					m_flags;
	 uint32_t					m_debug_flags;
	 char						pad1[ 20u ];
	 cur_dir32_t				m_dir;
	 unicode_string32_t	m_dll_path;
	 unicode_string32_t	m_image_path_name;
	 unicode_string32_t	m_cmd_line;
};

// 64
struct rtl_user_process_params_t
{
	 void* pad0;
	 uint32_t				m_flags;
	 uint32_t				m_debug_flags;
	 char					pad1[ 40u ];
	 cur_dir_t			m_dir;
	 unicode_string_t	m_dll_path;
	 unicode_string_t	m_image_path_name;
	 unicode_string_t	m_cmd_line;
};

struct peb_ldr_data32_t
{
	 uint32_t			m_length;
	 uint8_t			m_initialized;
	 uint32_t			m_ss_handle;
	 list_entry32_t	m_in_load_order_module_list;
	 list_entry32_t	m_in_memory_order_module_list;
	 list_entry32_t	m_in_initialization_order_module_list;
	 uint32_t			m_entry_in_progress;
	 uint8_t			m_shutdown_in_progress;
	 uint32_t			m_shutdown_thread_id;
};

// 64
struct peb_ldr_data_t
{
	 uint32_t		m_length;
	 uint8_t		m_initialized;
	 uint64_t		m_ss_handle;
	 _LIST_ENTRY	m_in_load_order_module_list;
	 _LIST_ENTRY	m_in_memory_order_module_list;
	 _LIST_ENTRY	m_in_initialization_order_module_list;
	 uint64_t		m_entry_in_progress;
	 uint8_t		m_shutdown_in_progress;
	 uint64_t		m_shutdown_thread_id;
};

struct ldr_data_table_entry32_t
{
	 list_entry32_t			m_in_load_order_links;
	 list_entry32_t			m_in_memory_order_links;
	 list_entry32_t			m_in_initialization_order_links;
	 uint32_t					m_base_address;
	 uint32_t					m_entry_point;
	 uint32_t					m_size_of_image;
	 unicode_string32_t	m_full_dll_name;
	 unicode_string32_t	m_base_dll_name;
	 uint32_t					m_flags;
	 uint16_t					m_obsolete_load_count;
	 uint16_t					m_tls_index;
	 list_entry32_t			m_hash_links;
	 uint32_t					m_time_date_stamp;
};

struct ldr_data_table_entry_t
{
	 LIST_ENTRY		m_in_load_order_links;
	 LIST_ENTRY		m_in_memoryo_rder_links;
	 LIST_ENTRY		m_in_initialization_order_links;
	 uint64_t			m_base_address;
	 uint64_t			m_entry_point;
	 uint64_t			m_size_of_image;
	 UNICODE_STRING	m_full_dll_name;
	 UNICODE_STRING	m_base_dll_name;
	 uint32_t			m_flags;
	 uint16_t			m_load_count;
	 uint16_t			m_tls_index;
	 LIST_ENTRY		m_hash_table_entry;
	 uint64_t			m_time_date_stamp;
};

struct peb_t
{
	 char								pad0[ 3 ];					  // 0x0
	 uint8_t							m_flags;						  // 0x3
	 char								pad1[ 18u ];				  // 0x4
	 peb_ldr_data_t* m_ldr;										  // 0x18
	 rtl_user_process_params_t* m_user_process_params;
};

static_assert( offsetof( peb_t, m_ldr ) == 0x18, "wrong" );

struct peb32_t
{
	 char		pad0[ 3u ];						 // 0x0
	 uint8_t	m_flags;							 // 0x3
	 char		pad1[ 8u ];						 // 0x4
	 uint32_t	m_ldr;						 // 0xC
	 uint32_t	m_user_process_params;
};

enum struct e_sys_dll_type : int
{
	 ps_native_system_dll,
	 ps_wow_x86_system_dll,
	 ps_wow_arm32_system_dll,
	 ps_wow_amd64_system_dll,
	 ps_wow_chpex86_system_dll,
	 ps_vsm_enclave_runtime_dll,
	 ps_system_dll_total_types
};

struct wow64_process_t
{
	 peb32_t* m_peb;
	 uint16_t			m_machine;
	 e_sys_dll_type	m_ntdll_type;
};

struct eprocess_t
{
	 char pad[ 0x28 ];
	 uint64_t m_directory_table_base; // 0x28
	 char pad_0[ 0x3a8 ];// 0x30
	 void* m_instrumentation_callback; // 0x3d8
	 char pad_1[ 0x60 ];// 0x3e0
	 uint64_t m_process_id; // 0x440
	 char pad_2[ 0x108 ];// 0x448
	 peb_t* m_peb; // 0x550
	 char pad_3[ 0x28 ];// 0x558
	 wow64_process_t* m_wow64_process; // 0x580
	 char pad_4[ 0x20 ];// 0x588
	 char m_image_file_name[ 15 ]; // 0x5a8
	 char pad_5[ 0x29 ];// 0x5b7
	 _LIST_ENTRY m_thread_list_head; // 0x5e0
	 char pad_6[ 0x1e4 ];// 0x5f0
	 uint32_t m_exit_status; // 0x7d4
	 rtl_avl_tree_t m_vad_root; // 0x7d8
	 //void* m_vad_hint; // 0x7e0
	 //uint64_t m_vad_count; // 0x7e8
	 char pad_7[ 0x8c ];// 0x7f0
	 uint32_t m_flags3; // 0x87c
};

struct ethread_t
{
	 char				pad0[ 184u ];
	 eprocess_t* m_proc; // 0xb8
	 char pad_0[ 0x30 ];// 0xc0
	 void* m_teb; // 0xf0
	 char pad_1[ 0x8c ];// 0xf8
	 uint8_t m_state; // 0x184
	 char pad_2[ 0x2 ];// 0x185
	 uint8_t m_wait_mode; // 0x187
	 char pad_3[ 0xaa ];// 0x188
	 uint8_t			m_prev_mode; // 0x232
	 char pad_4[ 0x50 ];// 0x233
	 uint8_t m_wait_reason; // 0x283
	 char pad_5[ 0x1f4 ];// 0x284
	 _CLIENT_ID		m_client_id; // 0x478
	 char				pad3[ 96u ];// 0x488
	 _LIST_ENTRY		m_thread_list_entry; // 0x4e8
	 char				pad4[ 24u ]; // 0x4f8
	 uint32_t			m_cross_thread_flags; // 0x510
	 char				pad5[ 52u ]; // 0x514
	 uint32_t			m_exit_status; // 0x548
};

struct process_instrument_callback_info_t
{
	 uint32_t		m_version;
	 uint32_t		m_reserved;
	 uintptr_t	m_callback;
};

struct mm_address_list_t
{
	 uint64_t	pad0;
	 void* m_end_va;
};

struct rtl_bitmap_ex_t
{
	 uint64_t	m_size_of_bitmap;
	 void* m_buffer;
};

struct ex_push_lock_t
{
	 union
	 {
		  uint64_t m_locked : 1;
		  uint64_t m_waiting : 1;
		  uint64_t m_waking : 1;
		  uint64_t m_multiple_shared : 1;
		  uint64_t m_shared : 60;
		  uint64_t m_value;
		  void* m_ptr;
	 };
};

struct mm_pte_t
{
	 union
	 {
		  uint64_t m_long;

		  struct
		  {
				uint64_t m_valid : 1;
				uint64_t m_dirty1 : 1;
				uint64_t m_owner : 1;
				uint64_t m_write_through : 1;
				uint64_t m_cache_disable : 1;
				uint64_t m_accessed : 1;
				uint64_t m_dirty : 1;
				uint64_t m_large_page : 1;
				uint64_t m_global : 1;
				uint64_t m_copy_on_write : 1;
				uint64_t m_unused : 1;
